{
    "name": "Environment and Obstacles",
    "nameNice": "Creating the Environment and the Obstacles",
    "descriptionShort": "This section looks at creating the game environment",
    "description": "This section looks at creating the environment for the game, making the player interact with it and programmatically creating the obstacles the player must pass through.",
    "lessons": [{
        "name": "part1-1",
        "nameNice": "Introduction",
        "description": "Outlining how we will go about working through this section."
    },
    {
        "name": "part1-2",
        "nameNice": "Creating the Ground",
        "description": "Drawing the ground, using variables to determine its dimensions."
    },
    {
        "name": "part2-1",
        "nameNice": "Making Moving Obstacles",
        "description": "Briefly discusses the strategy to how you will generate obstacles"
    },
    {
        "name": "part2-2",
        "nameNice": "Creating the Obstacle Generation Function",
        "description": "Here you'll create your obstacle generating function and create some variables in it to use when making the obstacles"
    },
    {
        "name": "part2-3",
        "nameNice": "Generating Obstacle Entities",
        "description": "In this section you'll finish off your obstacle generation function by generating a pair of entities using the variables created earlier"
    },
    {
        "name": "part2-4",
        "nameNice": "Creating Obstacles at set Intervals",
        "description": "Adding a counter and using it to create obstacles at a fixed rate"
    },
    {
        "name": "part2-5",
        "nameNice": "Moving the Obstacles!",
        "description": "Here you will add code to the game loop to move obstacles across the screen and destroy them if they go off the screen" 
    },
    {
        "name": "part3-1",
        "nameNice": "Detecting Collisions With the Player",
        "description": "We briefly discuss how we're going to detect collisions and use it to make the game properly playable"
    },
    {
        "name": "part3-2",
        "nameNice": "Adding Collision Component and Checking for Hits",
        "description": "Adding the collision component to the player and checking for hits with the ground and obstacles. The game will freeze if a hit happens."
    }]
}
